{
	"name": "Hiruko",
	"isNamedCreature": true,
	"source": "",
	"page": 0,
	"size": "L",
	"type": "construct",
	"alignment": [
		"U"
	],
	"ac": [
		{
			"ac": 20,
			"from": [
				"natural armor"
			]
		}
	],
	"hp": {
		"average": 142,
		"formula": "15d10 + 60"
	},
	"speed": {
		"walk": 30
	},
	"str": 20,
	"dex": 10,
	"con": 18,
	"int": 3,
	"wis": 14,
	"cha": 3,
	"senses": [
		"tremorsense 60 ft."
	],
	"passive": 12,
	"immune": [
		"poison",
		"psychic"
	],
	"conditionImmune": [
		"charmed",
		"exhaustion",
		"frightened",
		"paralyzed",
		"petrified",
		"poisoned"
	],
	"languages": [
		""
	],
	"cr": "16",
	"trait": [
		{
			"name": "Empty Shell",
			"entries": [
				"Hiruko must either be controlled by another creature capable of controlling puppets or be piloted by a Medium or smaller creature."
			]
		}
	],
	"action": [
		{
			"name": "Multiattack",
			"entries": [
				"Hiruko makes two Iron Tail or Senbon Volley attacks."
			]
		},
		{
			"name": "Iron Tail",
			"entries": [
				"{@atk mw} {@hit 10} to hit, reach 10 ft., one creature. {@h}32 ({@damage 6d8 + 5}) slashing damage."
			]
		},
		{
			"name": "Senbon Volley",
			"entries": [
				"{@atk rw} {@hit 10} to hit, range 15/30 ft., one creature. {@h}22 ({@damage 6d4 + 5}) piercing damage."
			]
		},
		{
			"name": "Senbon Blast {@recharge 5}",
			"entries": [
				"All creatures in a 30 ft. radius must succeed a {@dc 18} Dexterity saving throw or take 28 ({@damage 6d6 + 5}) piercing damage."
			]
		}
	],
	"reaction": [
		{
			"name": "Tail Defense",
			"entries": [
				"Hiruko gains +2 AC and can not use his Iron Tail attack. He may end this effect as a bonus action"
			]
		}
	],
	"senseTags": [
		"T"
	],
	"actionTags": [
		"Multiattack"
	],
	"damageTags": [
		"P",
		"S"
	],
	"miscTags": [
		"MW",
		"RCH",
		"RW"
	]
}
,
{
	"name": "Deidara",
	"isNamedCreature": true,
	"source": "",
	"page": 0,
	"size": "M",
	"type": {
		"type": "humanoid",
		"tags": [
			"human"
		]
	},
	"alignment": [
		"C",
		"N"
	],
	"ac": [
		{
			"ac": 16,
			"from": [
				"natural armor"
			]
		}
	],
	"hp": {
		"average": 149,
		"formula": "23d8 + 46"
	},
	"speed": {
		"walk": 40
	},
	"str": 14,
	"dex": 18,
	"con": 14,
	"int": 14,
	"wis": 14,
	"cha": 11,
	"save": {
		"dexterity": "+8",
		"wisdom": "+6"
	},
	"skill": {
		"perception": "+9"
	},
	"passive": 19,
	"languages": [
		"Common"
	],
	"cr": "12",
	"trait": [
		{
			"name": "Chakra",
			"entries": [
				"Deidara has 28 chakra points which he can expend. All chakra points are regained at the end of a long rest."
			]
		}
	],
	"action": [
		{
			"name": "Unarmed Strike",
			"entries": [
				"{@atk mw} {@hit 8} to hit, reach 5 ft., one target. {@h}6 ({@damage 1d4 + 4}) bludgeoning damage."
			]
		},
		{
			"name": "C4 (4 Chakra)",
			"entries": [
				"Deidara creates a massive clay clone of himself that explodes into a cloud of microscopic bombs up to 45 feet away. Any creatures of his choice in a 30 foot radius must attempt a {@dc 10} Wisdom or Dexterity saving throw. On a failure, they take 13 ({@damage 2d8 + 4}) Force damage. For 5 minutes, all creatures within the area must hold their breath or take 13 ({@dice 2d8 + 4}) at the beginning of each of their turns."
			]
		},
		{
			"name": "C3 (20 Chakra)",
			"entries": [
				"Deidara creates a statue of explosive clay and drops it. All creatures within a 180 foot radius directly below him must succeed a {@dc 18} Dexterity saving throw. On a failure, they take 72 ({@damage 15d8 + 4}) force damage. On a success, they take half as much. This deals twice as much damage to objects."
			]
		},
		{
			"name": "C2 (8 Chakra)",
			"entries": [
				"Deidara creates a dragon made of explosive clay that acts on his turn. It has 15 hit points, can't speak, and has no actions. At will, Deidara can detonate it. All creatures within 15 feet of the dragon must succeed a {@dc 14} Dexterity saving throw. On a failure, they take 16 ({@damage 4d6 + 4}) force damage. On a success, they take half as much."
			]
		},
		{
			"name": "C1 (1 Chakra)",
			"entries": [
				"{@atk rs} {@hit 8} to hit, range 30/60 ft., one target. {@h}9 ({@damage 2d4 + 4}) fire damage."
			]
		},
		{
			"name": "C0",
			"entries": [
				"Deidara transforms his entire body into a bomb. All creatures within a 180 foot radius of Deidara must succeed a {@dc 18} Dexterity saving throw. On a failure, they take force damage equal to his remaining hit points. On a success, they take half as much. This deals twice as much damage to objects. After using this jutsu, he is killed instantly."
			]
		}
	],
	"languageTags": [
		"C"
	],
	"damageTags": [
		"B",
		"F",
		"O"
	],
	"miscTags": [
		"MW"
	]
}
,
{
	"name": "Itachi Uchiha",
	"isNamedCreature": true,
	"source": "",
	"page": 0,
	"size": "M",
	"type": {
		"type": "humanoid",
		"tags": [
			"uchiha"
		]
	},
	"alignment": [
		"L",
		"G"
	],
	"ac": [
		{
			"ac": 24,
			"from": [
				"natural armor"
			]
		}
	],
	"hp": {
		"average": 56,
		"formula": "16d8 - 16"
	},
	"speed": {
		"walk": 70
	},
	"str": 10,
	"dex": 20,
	"con": 8,
	"int": 20,
	"wis": 14,
	"cha": 10,
	"save": {
		"dex": "+11",
		"wis": "+8"
	},
	"skill": {
		"acrobatics": "+11",
		"deception": "+6",
		"insight": "+8",
		"perception": "+8",
		"persuasion": "+6",
		"sleight of hand": "+11",
		"stealth": "+11"
	},
	"passive": null,
	"languages": [
		"Common"
	],
	"cr": "20",
	"trait": [
		{
			"name": "Chakra",
			"entries": [
				"Itachi has 39 chakra points which he can expend. All chakra points are regained at the end of a long rest."
			]
		},
		{
			"name": "Evasion",
			"entries": [
				"When Itachi is targeted by an area effect that lets him make a Dexterity saving throw to take only half damage, such as fireball, he instead takes no damage if he succeeds on the saving throw, and only half damage if he fails the save."
			]
		},
		{
			"name": "Ninja Speed",
			"entries": [
				"Itachi can take the dash, dodge, and disengage actions as a bonus action, and can move along vertical surfaces.",
				"Sharingan: Itachi gains the following:",
				"Advantage on Wisdom and Dexterity saving throws.",
				"Advantage on Perception checks.",
				"Itachi can sense the presence of magic and chakra within 30 feet of him. If he senses magic or chakra in this way, he can use his action to see a faint aura around any visible creature or object in the area that bears either or both, and he learns its school of magic or the chakra technique used, if any. This effect can penetrate most barriers, but is blocked by 1 foot of stone, 1 inch of Common metal, a thin sheet of lead, or 3 feet of wood or dirt.",
				"Itachi automatically detects visual illusions and genjutsu and has advantage on saving throws against them."
			]
		}
	],
	"action": [
		{
			"name": "Multiattack",
			"entries": [
				"Itachi can use Body Flicker and make 3 unarmed strike or kunai attacks."
			]
		},
		{
			"name": "Unarmed Strike",
			"entries": [
				"{@atk mw} {@hit 11} to hit, reach 5 ft., one target. {@h}15 ({@dice 4d4 + 5}) magical bludgeoning damage."
			]
		},
		{
			"name": "Kunai",
			"entries": [
				"Thrown Weapon Attack: {@hit 11} to hit, range 30/60 ft., one target. {@h}7 ({@damage 1d4 + 5}) piercing damage. Itachi may spend up to 3 chakra when he takes this action, making one additional attack per chakra point spent. Each additional kunai deals 3 ({@damage 1d4 + 1}) piercing damage on a hit."
			]
		},
		{
			"name": "Early Sacrifice (3 Chakra)",
			"entries": [
				"Itachi moves to any space that would leave the target in range and forces them to attempt a {@dc 19} Dexterity saving throw. On a failure, they are knocked {@condition prone} and take 15 ({@dice 4d4 + 5}) magical bludgeoning damage."
			]
		},
		{
			"name": "Transformation (1+ Chakra)",
			"entries": [
				"Itachi becomes identical to a person, creature or non-magical object he a complete visual image of. This can not be a light source, armor, tool, or vehicle and, and he can not recreate a magical effect. Creatures must make a {@dc 17} Investigation check realize that he is transformed. If the creature saw his performing the Jutsu, they automatically succeed. This does not change statistics, save for granting the creature's swimming and flying speeds."
			]
		},
		{
			"name": "Body Flicker (3 Chakra)",
			"entries": [
				"Itachi's movement speed doubles, and his movement does not provoke attacks of opportunity."
			]
		},
		{
			"name": "Basic Ninjutsu Technique (1 Chakra)",
			"entries": [
				"As a bonus action, Itachi can move across liquid surfaces as if they were solid. If he is submerged, he rises to the surface of the liquid at a rate of 60 feet per round."
			]
		},
		{
			"name": "Flame Whirlwind (1 Chakra)",
			"entries": [
				"{@atk rs} {@hit 11} to hit, range 30 ft., one target. {@h}9 ({@damage 1d8 + 5}) fire damage."
			]
		},
		{
			"name": "Exploding Flame Shot (4 Chakra)",
			"entries": [
				"{@atk rs} {@hit 11} to hit, range 60 ft., three targets. {@h}12 ({@damage 2d6 + 5}) fire damage and the target is set on fire. At the start of its turn, it takes 3 ({@damage 1d6}) fire damage. At the end of each of its turns, the target must make a {@dc 19} Constitution saving throw. On a successful save, it's no longer on fire. If the target or a creature within 5 feet of it uses an action to put out the flames, or if some other effect douses the flames (such as the target being submerged in water), it is no longer on fire."
			]
		},
		{
			"name": "Great Fireball (8 Chakra)",
			"entries": [
				"{@atk rs} {@hit 11} to hit, range 150 ft., one target. {@h}39 ({@dice 8d6 + 5}) modifier fire damage."
			]
		},
		{
			"name": "Great Fire Annihilation (14 Chakra)",
			"entries": [
				"Every creature in a 30 foot wide, 60 foot line must make a {@dc 19} Dexterity saving throw, taking 26 ({@damage 6d6 + 5}) fire damage on a failure, or half as much damage on a success. The targets cannot benefit from Evasion. For 1 minute (concentration), as a bonus action, you can deal an additional 6 ({@damage 2d6}) fire damage in the area."
			]
		},
		{
			"name": "Fire Dragon Flame Bullet (22 Chakra)",
			"entries": [
				"Every creature in a 150 ft. long, 10 ft. wide line must make a {@dc 19} Dexterity saving throw, taking 35 ({@damage 10d6 + 5}) fire damage and catching on fire for 1 minute on a failure. On a success, they take half as much damage and are not ignited. At the start of its turn, it takes 10 ({@damage 2d10}) fire damage. At the end of each of its turns, a creature must make a Constitution saving throw. On a successful save, it's no longer on fire. If the target or a creature within 5 feet of it uses an action to put out the flames, or if some other effect douses the flames (such as the target being submerged in water), it is no longer on fire."
			]
		},
		{
			"name": "Water Gun (1 Chakra)",
			"entries": [
				"{@atk mw} {@hit 11} to hit, range 20 ft., one target. {@h}9 ({@dice 1d8 + 5}) magical piercing damage."
			]
		},
		{
			"name": "Genjutsu (5-12 Chakra)",
			"entries": [
				"While Itachi is benefitting from sharingan, one creature within 40 feet that is not blind, or one creature he can touch (in which case they have disadvantage), must succeed a {@dc 19} Wisdom saving throw. On a failure, they are effected by one of the following for 1 minute (concentration):",
				"The target is {@condition blinded}. Costs 7 chakra.",
				"The target is {@condition deafened}. Costs 5 chakra.",
				"The target is {@condition frightened}. Costs 6 chakra.",
				"The target is affected by the confusion spell. Costs 8 chakra.",
				"The target is {@condition restrained}. Costs 8 chakra.",
				"The target is {@condition paralyzed}. Costs 12 chakra.",
				"The target takes 14 ({@damage 3d8}) psychic damage. Costs 10 chakra."
			]
		},
		{
			"name": "Clone Great Explosion (4+ Chakra/Clone)",
			"entries": [
				"Itachi creates up to 5 clones. The clones have 5 hit points each, and they have the chakra spent creating them. The clones can take actions as normal, however they do not benefit from the Extra Attack feature. Itachi controls them and they act on the same initiative as him. They last until they are reduced to 0 hit points, they expend all of their chakra, Itachi dismisses them at will, or Itachi falls {@condition unconscious}. If the clone still has chakra when it dissipates, he regains any remaining chakra from the clone - 4 (minimum 0).",
				"Clones have no range limit as to how far away they can be.",
				"For 1 chakra, created clones can exist for up to 4 rounds, as determined when he creates them. It is most suggested to keep track of this with a {@dice d4}. At the end of this clone's final turn, or when it is destroyed by any means other than being dispelled, every creature within 5 ft. of the clone must attempt a {@dc 19} Dexterity saving throw. On a failure, they takes 9 ({@damage 2d8}) fire damage. On a success, they take half as much damage. This also causes himto not regain the base chakra spent to create the clone.",
				"Any effects affecting Itachi when the clone is created carries over to the clone.",
				"A clone carries a copy of all his equipment, however it does not carry the magical effects over from it beside any base attack roll, damage roll, or AC bonuses (i.e. a cloned vorpal sword is just a +3 sword in the hand of a clone).",
				"While the clone is active, Itachi is aware of its current activities (such as sleeping, eating, running, fighting or even calculus). When a clone dissipates, the main body will receive any knowledge, experiences and memories it has acquired as if it experienced it itself, as well as matching his clone's {@condition exhaustion} and gradual blindness, deafness, and numbness level (i.e. If he has an {@condition exhaustion} level of 2 while his clone clone has 5, your {@condition exhaustion} level will increase to 5), but it will not suffer negative effects such as curses, poison or anything of the like."
			]
		},
		{
			"name": "Amaterasu",
			"entries": [
				"One creature within 60 ft. must attempt a {@dc 19} Dexterity saving throw. If it fails, it takes 16 ({@damage 2d10 + 5}) fire damage and at the start of its turn, it takes 10 ({@damage 1d10 + 5}) fire damage. This can only affect one creature at a time. After using this, Itachi must attempt a {@dc 18} Constitution saving throw. On a failure, he takes 8 ({@damage 3d4}) psychic damage, and he gains 1 level of gradual blindness. For every other failure of this saving throw, he gains 1 level of {@condition exhaustion} The DC on this saving throw increases by 1 on each use."
			]
		},
		{
			"name": "Tsukuyomi",
			"entries": [
				"One creature Itachi can see the eyes of must attempt a {@dc 19} Wisdom saving throw. On a failure, they are {@condition paralyzed} until the beginning of their turn, and he may choose to force them to gain up to 3 levels of {@condition exhaustion}. This can not increase a creature's {@condition exhaustion} above 3 levels. After using this, Itachi must attempt a {@dc 18} Constitution saving throw. On a failure, he takes 8 ({@damage 3d4}) psychic damage, and he gains 1 level of gradual blindness. For every other failure of this saving throw, he gains 1 level of {@condition exhaustion} The DC on this saving throw increases by 1 on each use."
			]
		},
		{
			"name": "Armored Susanoo",
			"entries": [
				"Itachi becomes Huge, he gains 60 temporary hit points, and he gains the Susanoo Strike, Susanoo Crush, Susanoo Spear, Yasaka Magatama, and Susanoo: Tsukumo actions. Any creatures of Itachi's choice can occupy and move through his space without spending additional movement. Any effect that would target a creature inside Itachi's space targets Itachi instead, and creatures cannot affect anything outside of his space from within. If another creature is occupying Itachi's space, they may contribute the benefits of any feature that has a duration and would target themselves, such as Second Stage or Sage Mode, to him instead. Once per turn, Itachi may designate a single damage type or chakra nature to be immune to. Itachi loses these benefits if his temporary hit points reach 0. After using this, Itachi must attempt a {@dc 18} Constitution saving throw. On a failure, he takes 8 ({@damage 3d4}) psychic damage, and he gains 1 level of gradual blindness. For every other failure of this saving throw, he gains 1 level of {@condition exhaustion} The DC on this saving throw increases by 1 on each use."
			]
		},
		{
			"name": "Susanoo Strike",
			"entries": [
				"{@atk mw} {@hit 11} to hit, reach 20 ft., one target. {@h}16 ({@dice 2d10 + 5}) magical bludgeoning damage. On a successful hit, Itachi can attempt to grapple a creature with advantage."
			]
		},
		{
			"name": "Susanoo Crush",
			"entries": [
				"A creature that Itachi is grappling must succeed a {@dc 18} Constitution saving throw or take 24 ({@dice 4d8 + 5}) magical bludgeoning damage.",
				"Totsuka Blade Melee Weapon Attack: {@hit 11} to hit, reach 25 ft., one target. {@h}25 ({@dice 3d12 + 5}) magical slashing damage and 4 ({@damage 1d8}) fire damage, and for 14 chakra, the target must attempt a {@dc 19} Dexterity saving throw. On a failure, they are trapped as per the minimus containment variant of the Imprisonment spell."
			]
		},
		{
			"name": "Yasaka Magatama (15 Chakra)",
			"entries": [
				"{@atk rs} {@hit 11} to hit, range 60 ft., three targets. {@h}19 ({@damage 3d8 + 5}) force damage. On a miss, they take half as much damage. This effect is treated as a Dexterity or Constitution saving throw for the sake of Evasion and Endurance"
			]
		}
	],
	"reaction": [
		{
			"name": "Substitution (3+ Chakra)",
			"entries": [
				"When Itachi is hit by an attack and would take damage, he decreases the damage by 25 ({@dice 1d10 + 20}) and teleports up to 15 ft. in any direction to an unoccupied space, during which he takes the Hide action. A generic object is left in his place and he takes any remaining damage from that attack. Itachi can add reduce this damage by an additional 6 ({@dice 1d10}) points per chakra point spent over the initial cost."
			]
		},
		{
			"name": "Sharingan Dodge",
			"entries": [
				"When Itachi is benefitting from sharingan, he imposes disadvantage on one attack against him. Itachi can use this 3 times, regaining all uses at the end of a short rest."
			]
		},
		{
			"name": "Replication",
			"entries": [
				"When a creature Itachi can see uses a feature while his sharingan is active, he copies it, becoming able to use the feature in the exact same manner. If the feature is a class feature that must be activated in some way but does not have limited uses (i.e. making an Extra Attack, moving more than their standard movement speed using Unarmored Movement, or adding Foe Slayer's damage), Itachi may use it in the same manner for an amount of chakra equal to twice the level it was gained at. Itachi can not gain features with a limited number of uses that don't use a standard currency, features that are always active, or features from non-humanoid creatures. Itachi may have up to 3 of these features memorized at a time. Itachi may only use memorized features while his sharingan is active."
			]
		},
		{
			"name": "Demonic Illusion",
			"entries": [
				"Mirror Heaven and Earth (9 Chakra). When Itachi is targeted by genjutsu or an illusion spell by a creature within 40 ft., they are subject to the spell or genjutsu's effect instead, using the same save DC or attack roll."
			]
		}
	],
	"actionTags": [
		"Multiattack"
	],
	"languageTags": [
		"C"
	],
	"damageTags": [
		"F",
		"O",
		"P",
		"Y"
	],
	"miscTags": [
		"MW",
		"RCH"
	],
	"conditionInflict": [
		"blinded",
		"deafened",
		"exhaustion",
		"frightened",
		"paralyzed",
		"restrained"
	]
}
,
{
	"name": "Pain",
	"source": "",
	"page": 0,
	"size": "M",
	"type": {
		"type": "humanoid",
		"tags": [
			"human"
		]
	},
	"alignment": [
		"L",
		"N"
	],
	"ac": [
		{
			"ac": 19,
			"from": [
				"natural armor"
			]
		}
	],
	"hp": {
		"average": 117,
		"formula": "18d8 + 36"
	},
	"speed": {
		"walk": 45
	},
	"str": 16,
	"dex": 20,
	"con": 14,
	"int": 20,
	"wis": 18,
	"cha": 12,
	"save": {
		"dexterity": "+15",
		"wisdom": "+15"
	},
	"skill": {
		"acrobatics": "+10",
		"perception": "+8",
		"intimidation": "+7",
		"sensespassiveperception": "18",
		"truesight120": "feet."
	},
	"languages": [
		"Common"
	],
	"cr": "15",
	"trait": [
		{
			"name": "Chakra",
			"entries": [
				"The Six Paths of Pain collectively have 90 chakra points which he can expend. All chakra points are regained at the end of a long rest."
			]
		},
		{
			"name": "Chakra Sense",
			"entries": [
				"The Six Paths of Pain can sense chakra and magical effects within 100 feet of them."
			]
		},
		{
			"name": "Shared Vision",
			"entries": [
				"Each Path of Pain can see and sense anything that the other Paths can."
			]
		},
		{
			"name": "Divided Paths",
			"entries": [
				"Each Path of Pain has access to one Path, as indicated on this page by being under larger text."
			]
		}
	],
	"action": [
		{
			"name": "Unarmed Strike",
			"entries": [
				"{@atk mw} {@hit 10} to hit, reach 5 ft., one target. {@h}10 ({@damage 2d4 + 5}) bludgeoning damage.",
				"Deva Path The Deva Path of Pain can use Shinra Tensei, Bansho Ten'in, and Chibaku Tensei."
			]
		},
		{
			"name": "Shinra Tensei (5+ Chakra)",
			"entries": [
				"Each creature within 30 + 5 per additional chakra point spent foot radius must succeed a {@dc 18} Strength saving throw. On a failure, they are pushed to the closest edge of this action's range and take {@dice 2d6 + 1d6} per additional chakra point spent force damage. If 20 or more chakra is spent on this jutsu, objects take twice as much damage."
			]
		},
		{
			"name": "Bansho Ten'in (2+ Chakra)",
			"entries": [
				"Each creature within 30 + 5 per additional chakra point spent foot radius must succeed a {@dc 18} Strength saving throw. On a failure, they moved any distance toward the Deva Path of his choice in the most direct path possible."
			]
		},
		{
			"name": "Chibaku Tensei (30+ Chakra)",
			"entries": [
				"The Deva Path launches a black sphere within 1 mile of himself that becomes an up to 160 foot sphere as it rips up parts of the terrain. All creatures within 60 feet of the sphere must succeed a {@dc 18} Strength saving throw. On a failure, they are drawn to the closest area of the sphere and are {@condition restrained}. All creatures within 10 + 5 per additional chakra point spent feet of the sphere must retry this saving throw at the end of each of their turns for 1 hour. This effect ends early if it impacts the ground, as detailed later, the sphere, which has an AC of 26 and has 30 HP is destroyed, or the Deva Path ends it early. It is immune to Psychic damage but vulnerable to force damage. The Deva Path may move the sphere up to 1 mile in any direction up to 5 miles from him as an action, or cause it to impact the ground directly beneath it. Upon impact, creatures {@condition restrained} by the Chibaku Tensei must succeed a Strength saving throw or take 31 ({@damage 8d6}) bludgeoning damage, while creatures within 60 feet of the satellite's edge must pass a Dexterity saving throw or take 39 ({@damage 10d6}) bludgeoning damage from the impact. On a success, creatures take half damage.",
				"Asura Path The Asura Path of Pain can use Weaponsmith"
			]
		},
		{
			"name": "Four-Armed Asura (2 Chakra)",
			"entries": [
				"The Asura Path grows 4 additional arms."
			]
		},
		{
			"name": "Weaponsmith (2 Chakra)",
			"entries": [
				"The Asura Path transforms one of his arms into one weapon of his choice. He can not be disarmed of this weapon."
			]
		},
		{
			"name": "Reinforced Asura (5 Chakra)",
			"entries": [
				"The Asura Path gains +5 AC for 1 minute or until he runs out of chakra."
			]
		},
		{
			"name": "Flaming Arrow of Amazing Ability (5 Chakra)",
			"entries": [
				"{@atk rs} {@hit 10} to hit, range 60 ft., one target. {@h}19 ({@dice 3d8 + 5}) magical bludgeoning damage."
			]
		},
		{
			"name": "Chakra Propulsion Cannon (10 Chakra)",
			"entries": [
				"All creatures in a 100 foot line must succeed a {@dc 18} Dexterity saving throw. On a failure, they take 20 ({@damage 4d6 + 5}) force damage. On a success, they take half as much.",
				"Human Path The Human Path of Pain can use Absorption Soul Technique."
			]
		},
		{
			"name": "Absorption Soul Technique (20 Chakra)",
			"entries": [
				"One creature within 30 feet must succeed a {@dc 18} Wisdom saving throw. On a failure, they take 24 ({@damage 4d8 + 5}) psychic damage and the Six Paths of Pain learn a portion of their knowledge. On a success, they take half as much damage.",
				"Animal Path The Animal Path of Pain can use Rinnegan Summoning."
			]
		},
		{
			"name": "Rinnegan Summoning (1+ Chakra)",
			"entries": [
				"The Animal Path summons one creature of his choice to an open space within 15 feet, spending a number of chakra equal to their CR. This creature has the Six Paths of Pain's Shared Vision and Chakra Sense feature, becomes Huge if it is not larger, and is {@condition charmed} by them. This action can only be used up to 5 times. He may also spend 10 chakra to summon the other Paths of Pain to him.",
				"Preta Path The Preta Path of Pain can use Seal Jutsu Absorption."
			]
		},
		{
			"name": "Seal Jutsu Absorption",
			"entries": [
				"One creature within 5 feet of the Preta Path must succeed a {@dc 18} Constitution saving throw. On a failure, they lose 22 ({@dice 3d8 + 8}) chakra points.",
				"Naraka Path The Naraka Path of Pain can use Jigokudo."
			]
		},
		{
			"name": "Jigokudo (25 Chakra)",
			"entries": [
				"While grappling another creature, the Naraka Path summons a massive disfigured head. The {@condition grappled} creature must succeed a {@dc 22} Wisdom saving throw. On a failure, they are {@condition paralyzed} until the end of their next turn. As an action, the Naraka Path can ask the creature a question. If they answer truthfully or succeed a {@dc 22} Deception check, they gain 1 level of {@condition exhaustion}. If they lie and fail the check, they take 42 ({@damage 6d8 + 5}) psychic damage. If this reduces a creature to 0 hit points, they die instantly.",
				"Outer Path The Outer Path of Pain can use Black Receivers, Demonic Statue Chains, Rinne Six Paths, Rinne Rebirth."
			]
		},
		{
			"name": "Multiattack",
			"entries": [
				"The Outer Path can make 8 Black Receiver or 4 Demonic Statue Chain attacks."
			]
		},
		{
			"name": "Black Receivers (10 Chakra)",
			"entries": [
				"{@atk rs} {@hit 10} to hit, range 120 ft., one target. {@h}9 ({@dice 1d8 + 5}) magical piercing damage and the receiver stays in their body. Each receiver has an AC of 23 and 5 hit points. The Outer Path can spend 1 chakra as an action to deal {@dice 1d4} fire per receiver to and reducing the movement speed by 20% per receiver until the beginning of his next turn of every creature of his choice with receivers in their body."
			]
		},
		{
			"name": "Demonic Statue Chains (15 Chakra)",
			"entries": [
				"{@atk rs} {@hit 10} to hit, range 100 ft., one target. {@h}45 ({@damage 5d8 + 5}) psychic damage and is {@condition grappled} by the Outer Path for 1 minute (concentration) or until they win the grapple contest. Jinchuriki {@condition grappled} by this Jutsu are not able to access their Subclass features for its duration. Tailed Beasts that are affected by this Jutsu are {@condition paralyzed} for the duration. As an action, the Outer Path can deal 14 ({@damage 2d8 + 5}) psychic damage to affected creatures."
			]
		},
		{
			"name": "Rinne Six Paths",
			"entries": [
				"Over 1 minute, the Outer Path can convert one corpse into a Path of Pain that does not exist yet."
			]
		},
		{
			"name": "Gedo Art of Rinne Rebirth",
			"entries": [
				"The Outer Path resurrects any number of creatuers as per the True Resurrection spell without the 200 year limit. He dies immediately after using this jutsu. He can only be resurrected by the Wish spell or a similar effect."
			]
		}
	],
	"reaction": [
		{
			"name": "Seal Jutsu Absorption",
			"entries": [
				"When the Preta Path is targeted by a jutsu that deals damage, he may erect a barrier, reducing its amount of chakra by 22 ({@dice 3d8 + 8}) chakra points, regaining half as much. If this reduces the jutsu to 0 chakra, it is completely dissipated."
			]
		}
	],
	"actionTags": [
		"Multiattack"
	],
	"languageTags": [
		"C"
	],
	"damageTags": [
		"B",
		"O",
		"Y"
	],
	"miscTags": [
		"MW"
	]
}
,
{
	"name": "Konan",
	"isNamedCreature": true,
	"source": "",
	"page": 0,
	"size": "M",
	"type": {
		"type": "humanoid",
		"tags": [
			"human"
		]
	},
	"alignment": [
		"L",
		"G"
	],
	"ac": [
		{
			"ac": 18,
			"from": [
				"natural armor"
			]
		}
	],
	"hp": {
		"average": 136,
		"formula": "21d8 + 42"
	},
	"speed": {
		"walk": 45
	},
	"str": 14,
	"dex": 18,
	"con": 14,
	"int": 14,
	"wis": 14,
	"cha": 11,
	"save": {
		"dexterity": "+8",
		"wisdom": "+6"
	},
	"skill": {
		"perception": "+9"
	},
	"passive": 19,
	"languages": [
		"Common"
	],
	"cr": "12",
	"trait": [
		{
			"name": "Chakra",
			"entries": [
				"Konan has 34 chakra points which she can expend. All chakra points are regained at the end of a long rest."
			]
		}
	],
	"action": [
		{
			"name": "Multiattack",
			"entries": [
				"Konan can make 4 paper shuriken attacks."
			]
		},
		{
			"name": "Unarmed Strike",
			"entries": [
				"{@atk mw} {@hit 8} to hit, reach 5 ft., one target. {@h}9 ({@damage 2d4 + 4}) bludgeoning damage."
			]
		},
		{
			"name": "Paper Shuriken",
			"entries": [
				"{@atk rw} {@hit 8} to hit, range 30/60 ft. {@h}5 ({@dice 1d3 + 4}) magical slashing damage."
			]
		},
		{
			"name": "Explosive Paper Shuriken",
			"entries": [
				"{@atk rw} {@hit 8} to hit, range 30/60 ft. {@h}11 ({@damage 2d6 + 4}) fire damage."
			]
		},
		{
			"name": "Dance of the Shikigami (5 Chakra)",
			"entries": [
				"Konan becomes a Huge cloud of paper. She can not take actions other than to end this effect, can squeeze through any opening, and attacks against her have disadvantage. If she ends this effect, she must designate a 5 foot area to reform into. If this area is occupied by another creature, they must initiate a grapple contest. If she succeeds, they or begin suffocating. If they escape this grapple, this effect ends."
			]
		},
		{
			"name": "Sacred Paper Emissary Jutsu (1 Chakra/10 Feet)",
			"entries": [
				"Konan creates an object up to 340 cubic feet in size. She may move any portion of this object up to 30 feet as an action. Any creature within this object's path must succeed a {@dc 15} Dexterity saving throw. On a failure, they take 59 ({@damage 10d10}) force damage. A creature may only be subject to this effect once per turn. Each 5 foot area of this object has an AC of 19 and 15 hit points. Konan exclusively uses this if no other option is available."
			]
		}
	],
	"actionTags": [
		"Multiattack"
	],
	"languageTags": [
		"C"
	],
	"damageTags": [
		"B",
		"F",
		"O"
	],
	"miscTags": [
		"MW",
		"RW"
	]
}
,
{
	"name": "Hidan",
	"isNamedCreature": true,
	"source": "",
	"page": 0,
	"size": "M",
	"type": {
		"type": "humanoid",
		"tags": [
			"human"
		]
	},
	"alignment": [
		"L",
		"E"
	],
	"ac": [
		{
			"ac": 14,
			"from": [
				"natural armor"
			]
		}
	],
	"hp": {
		"average": 33,
		"formula": "6d8 + 6"
	},
	"speed": {
		"walk": 30
	},
	"str": 12,
	"dex": 12,
	"con": 12,
	"int": 10,
	"wis": 12,
	"cha": 10,
	"save": {
		"charisma": "+4"
	},
	"skill": {
		"intimidation": "+4",
		"insight": "+5",
		"religion": "+10"
	},
	"passive": 11,
	"languages": [
		"Common"
	],
	"cr": "10",
	"trait": [
		{
			"name": "Danger to Himself",
			"entries": [
				"Hidan deals twice as much damage to himself."
			]
		},
		{
			"name": "Immortal",
			"entries": [
				"If Hidan is reduced to 0 hit points, he becomes {@condition paralyzed} instead of unconcious and he is decapitated. If another creature, such as Kakuzu reattaches his head, he is returned to full hit points."
			]
		}
	],
	"action": [
		{
			"name": "Scythe",
			"entries": [
				"{@atk mw} {@hit 5} to hit, reach 10 ft. or range 20/40 ft., one target. {@h}3 ({@damage 1d4 + 1}) slashing damage. If thrown, it deals 1 slashing damage. On a successful hit, he can choose to consume their blood."
			]
		},
		{
			"name": "Retractable Spear",
			"entries": [
				"{@atk mw} {@hit 5} to hit, reach 5 ft., one target. {@h}4 ({@damage 1d6 + 1}) piercing damage. On a successful hit, he can choose to consume their blood."
			]
		},
		{
			"name": "Jashin Ritual",
			"entries": [
				"Hidan creates a 10 foot radius ring of blood with the Jashin insignia also found on his necklace. Any damage dealt to him while within this area deals an equal percentage to the previous creature he consumed the blood of."
			]
		}
	],
	"languageTags": [
		"C"
	],
	"damageTags": [
		"P",
		"S"
	],
	"miscTags": [
		"MW",
		"RCH"
	]
}
,
{
	"name": "Kisame Hoshigaki",
	"isNamedCreature": true,
	"source": "",
	"page": 0,
	"size": "M",
	"type": {
		"type": "humanoid",
		"tags": [
			"human"
		]
	},
	"alignment": [
		"L",
		"E"
	],
	"ac": [
		{
			"ac": 20,
			"from": [
				"natural armor"
			]
		}
	],
	"hp": {
		"average": 190,
		"formula": "20d8 + 100"
	},
	"speed": {
		"walk": {
			"number": 45,
			"condition": "swimming"
		}
	},
	"str": 20,
	"dex": 16,
	"con": 20,
	"int": 18,
	"wis": 14,
	"cha": 12,
	"save": {
		"dexterity": "+15",
		"wisdom": "+15"
	},
	"skill": {
		"athletics": "+10",
		"perception": "+7",
		"intimidation": "+6"
	},
	"passive": 17,
	"languages": [
		"Common"
	],
	"cr": "15",
	"trait": [
		{
			"name": "Chakra",
			"entries": [
				"Kisame has 50 chakra points which he can expend. All chakra points are regained at the end of a long rest."
			]
		},
		{
			"name": "Fishlike",
			"entries": [
				"Kisame can breath in both air and water."
			]
		}
	],
	"action": [
		{
			"name": "Samehada",
			"entries": [
				"{@atk mw} {@hit 10} to hit, reach 5 ft., one target. {@h}16 ({@damage 3d6 + 5}) necrotic damage. On a hit, grants Kisame {@dice 1d6} temporary hit points or restores {@dice 1d6} chakra points."
			]
		},
		{
			"name": "Feeding Shark (7 Chakra)",
			"entries": [
				"While in at least 3 feet of water, Kisame creates 1 shark out of chakra. He may double this jutsu's cost to make it a bull shark, or triple it to create a giant shark. This shark acts on his turn and is controlled by him. He may use this multiple times on the same turn."
			]
		},
		{
			"name": "Water Prison (4 Chakra)",
			"entries": [
				"{@atk rs} {@hit 10} to hit, range 30 ft., one target. {@h}10 ({@damage 1d10 + 5}) bludgeoning damage and the target is {@condition restrained} for 1 minute (concentration). At the end of each of its turns, the target can make another Strength saving throw. On a success, the target is no longer {@condition restrained}."
			]
		},
		{
			"name": "Great Exploding Water Colliding Wave (25 Chakra)",
			"entries": [
				"Kisame creates an absurd amount of water out of his chakra creating a 60 foot sphere of water. This sphere follows his movements."
			]
		},
		{
			"name": "Bloody Mist Absorption Technique (6 Chakra",
			"entries": [
				"This can only be used while inside a Hidden Mist Jutsu of any origin, and deals 7 ({@damage 2d6}) necrotic damage to Kisame. All creatures except Kisame lose 1 chakra at the beginning of each of their turns and when they use a jutsu, and Kisame regains an equal number of hit points."
			]
		},
		{
			"name": "Hidden Mist Jutsu (7 Chakra)",
			"entries": [
				"A 40 ft. radius around Kisame is covered in a dense fog for 1 minute or until a wind of moderate or greater speed (at least 10 miles per hour) disperses it. This area counts as heavily obscured after beyond a 5 ft. radius for any creature that is not a member of the Seven Swordsmen of the Hidden Mist or has the Naruto:_Shinobi_(5e_Class)#Path_of_the_Assassin"
			]
		}
	],
	"reaction": [
		{
			"name": "Great Shark Bullet (8 Chakra)",
			"entries": [
				"' Kisame creates a massive shark out of chakra. If a creature was casting a spell or jutsu, they must succeed a Dexterity saving throw using their spellcasting modifier. On a failure, they do not use the jutsu and Kisame regains a number of chakra equal to the amount of chakra spent or twice the level the spell was cast."
			]
		}
	],
	"languageTags": [
		"C"
	],
	"damageTags": [
		"B",
		"N"
	],
	"miscTags": [
		"MW"
	],
	"conditionInflict": [
		"restrained"
	]
}
,
{
	"name": "Kakuzu",
	"isNamedCreature": true,
	"source": "",
	"page": 0,
	"size": "M",
	"type": "aberration",
	"alignment": [
		"C",
		"E"
	],
	"ac": [
		{
			"ac": 18,
			"from": [
				"natural armor"
			]
		}
	],
	"hp": {
		"average": 285,
		"formula": "30d8 + 150"
	},
	"speed": {
		"walk": 30
	},
	"str": 18,
	"dex": 12,
	"con": 20,
	"int": 14,
	"wis": 10,
	"cha": 10,
	"save": {
		"strength": "+9",
		"constitution": "+10",
		"wisdom": "+5"
	},
	"skill": {
		"perception": "+5"
	},
	"passive": 15,
	"languages": [
		"Common"
	],
	"cr": "15",
	"trait": [
		{
			"name": "Chakra",
			"entries": [
				"Kakuzu has 45 chakra points which he can expend. All chakra points are regained at the end of a long rest."
			]
		},
		{
			"name": "Earth Grudge Fear",
			"entries": [
				"If Kakuzu is reduced to 0 hit points, he can return to 30 hit points and 16 chakra up to 3 times. He may also expend one use of this feature to create a clone of himself within 30 feet that has 30 hit points and 16 chakra. He loses one Earth Grudge Fear action, and this clone loses all other Earth Grudge Fear actions."
			]
		}
	],
	"action": [
		{
			"name": "Unarmed Strike",
			"entries": [
				"{@atk mw} {@hit 9} to hit, reach 5 ft., one target. {@h}12 ({@dice 3d4 + 4}) magical bludgeoning damage."
			]
		},
		{
			"name": "Reattach",
			"entries": [
				"Kakuzu reattaches one missing limb to himself or another creature within 15 feet."
			]
		},
		{
			"name": "Earth Grudge Fear",
			"entries": [
				"Intelligent Hard Word (8 Chakra). One of Kakuzu's masks releases a stream of fire. All creatures in a 60 foot line must succeed a {@dc 18} Dexterity saving throw. On a failure, they take 23 ({@damage 4d8 + 5}) fire damage. On a success, they take half as much."
			]
		},
		{
			"name": "Earth Grudge Fear",
			"entries": [
				"False Darkness (8 Chakra). One of Kakuzu's masks releases a bolt of lightning. All creatures in a 60 foot line must succeed a {@dc 18} Constitution saving throw. On a failure, they take 23 ({@damage 4d8 + 5}) lightning damage. On a success, they take half as much."
			]
		},
		{
			"name": "Earth Grudge Fear",
			"entries": [
				"Pressure Damage (8 Chakra). One of Kakuzu's masks creates a dome of high-density air. All creatures of Kakuzu's choice in a 30 foot radius must succeed a {@dc 18} Dexterity saving throw. On a failure, they take 23 ({@damage 4d8 + 5}) thunder damage. On a success, they take half as much."
			]
		},
		{
			"name": "Earth Grudge Fear",
			"entries": [
				"Earth Spear (4 Chakra). One of Kakuzu's masks coats its body in Earth Style chakra. It becomes resistant to all damage except Lightning and Force damage until the end of its next turn."
			]
		}
	],
	"languageTags": [
		"C"
	],
	"damageTags": [
		"F",
		"L",
		"T"
	],
	"miscTags": [
		"MW"
	]
}
,
{
	"name": "Sasori",
	"isNamedCreature": true,
	"source": "",
	"page": 0,
	"size": "M",
	"type": "construct",
	"alignment": [
		"C",
		"N"
	],
	"ac": [
		{
			"ac": 16,
			"from": [
				"natural armor"
			]
		}
	],
	"hp": {
		"average": 143,
		"formula": "22d8 + 44"
	},
	"speed": {
		"walk": 40
	},
	"str": 12,
	"dex": 16,
	"con": 14,
	"int": 22,
	"wis": 17,
	"cha": 18,
	"save": {
		"int": "+10",
		"wis": "+7"
	},
	"skill": {
		"arcana": "+16",
		"perception": "+8"
	},
	"passive": 18,
	"resist": [
		"poison",
		"acid"
	],
	"immune": [
		"poison"
	],
	"conditionImmune": [
		"poisoned",
		"exhaustion"
	],
	"languages": [
		"Common"
	],
	"cr": "16",
	"trait": [
		{
			"name": "Chakra",
			"entries": [
				"Sasori has 32 chakra points which he can expend. All chakra points are regained at the end of a long rest."
			]
		}
	],
	"action": [
		{
			"name": "Bladed Arms",
			"entries": [
				"{@atk mw} {@hit 7} to hit, reach 5 ft., one target. {@h}8 ({@damage 2d4 + 3}) slashing damage."
			]
		},
		{
			"name": "Red Secret Technique",
			"entries": [
				"Performance of a Hundred Puppets (2 Chakra). Sasori summons one of his puppets. It can use the statistics of any Puppet except the Chikamatsu Collection of Ten, the Third Kazekage, or any other village's genin, chunin, or jonin and is controlled by him.",
				"Exploding Flame Shot (4 Chakra) Ranged Spell Attack: {@hit 10} to hit, range 30 ft., three targets. {@h}13 ({@damage 2d6 + 6}) fire damage and is set on fire for 1 minute. At the start of its turn, it takes {@damage 1d6} fire damage. At the end of each of its turns, the target must make a {@dc 18} Constitution saving throw. On a successful save, it's no longer on fire. If the target or a creature within 5 feet of it uses an action to put out the flames, or if some other effect douses the flames (such as the target being submerged in water), it is no longer on fire."
			]
		}
	],
	"languageTags": [
		"C"
	],
	"damageTags": [
		"F",
		"S"
	],
	"miscTags": [
		"MW"
	]
}
,
